#include "headfile.h"

//-------------------------------------------------------------------------------------------------------------------
// @brief		IIC_初始化
// @param		
// @return	void
// Sample usage: IIC_OLED_int();
//-------------------------------------------------------------------------------------------------------------------
void IIC_OLED_init ()
{
	gpio_init (IIC_PIN_SCL,GPO,1,GPO_PUSH_PULL ,GPIO_SPEED_50MHZ );
	gpio_init (IIC_PIN_SDA,GPO,1,GPO_PUSH_PULL ,GPIO_SPEED_50MHZ );
}
//-------------------------------------------------------------------------------------------------------------------
// @brief		IIC_开始
// @param		
// @return	void
// Sample usage: IIC_Start();
//-------------------------------------------------------------------------------------------------------------------
void IIC_Start(void)
{
//	SDA_OUT();     				//SDA线输出
	
	IIC_SDA(1);		
	IIC_SCL(1);	
	DWT_Delay_us(1);
	
 	IIC_SDA(0);							//START:当SCL为高电平时,SDA电平由高电平拉为低电平 	
	DWT_Delay_us(1);
	IIC_SCL(0);							//钳住I2C总线，准备发送或接收数据 
}	  
//-------------------------------------------------------------------------------------------------------------------
// @brief		IIC_停止
// @param		
// @return	void
// Sample usage: IIC_Stop();
//-------------------------------------------------------------------------------------------------------------------
void IIC_Stop(void)
{
//	SDA_OUT();						//SDA线输出
	
	IIC_SDA(0);							
	IIC_SCL(0);				
	DWT_Delay_us(1);
	
	IIC_SCL(1); 						//STOP:当SCL为高电平时,SDA电平由低电平拉为高电平
	DWT_Delay_us(1);
	IIC_SDA(1);							//发送I2C总线结束信号


}
//-------------------------------------------------------------------------------------------------------------------
// @brief		IIC_等待信号应答
// @param		
// @return	返回值：1，接收应答失败
//								  0，接收应答成功
// Sample usage: date = IIC_Wait_Ack;
//------------------------------------------------------------------------------------------------------------------- 
uint8_t IIC_Wait_Ack(void)
{
	uint8_t ucErrTime=0;
	SDA_IN();   					//SDA设置为输入  
	IIC_SDA(1);						//DWT_Delay_us(1);	   
	IIC_SCL(1);						//DWT_Delay_us(1);	 
	while(READ_SDA)				//返回一个低电平证明接收到了
	{
		ucErrTime++;
		if(ucErrTime>250)
		{
			IIC_Stop();
			return 1;
		}
	}
	IIC_SCL(0);//时钟输出0 	   
	return 0;  
} 
//-------------------------------------------------------------------------------------------------------------------
// @brief		IIC_产生信号应答
// @param		
// @return	
// Sample usage: IIC_Ack();
//------------------------------------------------------------------------------------------------------------------- 
void IIC_Ack(void)
{
	IIC_SCL(0);
	SDA_OUT();
	IIC_SDA(0);//产生应答就把总线拉低
	DWT_Delay_us(2);
	IIC_SCL(1);
	DWT_Delay_us(2);
	IIC_SCL(1);
}
//-------------------------------------------------------------------------------------------------------------------
// @brief		IIC_不产生信号应答
// @param		
// @return	
// Sample usage: IIC_NAck();
//------------------------------------------------------------------------------------------------------------------- 	    
void IIC_NAck(void)
{
	IIC_SCL(0);
	SDA_OUT();
	IIC_SDA(1);
	DWT_Delay_us(1);
	IIC_SCL(1);
	DWT_Delay_us(1);
	IIC_SCL(0);
}
//-------------------------------------------------------------------------------------------------------------------
// @brief		IIC_发送字节
// @param		
// @return	1，有应答
//					0，无应答		
// Sample usage: IIC_Send_Byte(0x00);
//------------------------------------------------------------------------------------------------------------------- 	  
void IIC_Send_Byte(uint8_t txd)
{                        
    uint8_t t;   
		SDA_OUT(); 	    
    IIC_SCL(0);//拉低时钟开始数据传输
    for(t=0;t<8;t++)
    {              
        IIC_SDA((txd&0x80)>>7);
        txd<<=1; 	  
				DWT_Delay_us(1);   //对TEA5767这三个延时都是必须的
				IIC_SCL(1);
				DWT_Delay_us(1); 
				IIC_SCL(0);	
				DWT_Delay_us(1);
    }	 
		IIC_Ack();
} 	    
//读1个字节，ack=1时，发送ACK，ack=0，发送nACK   
//-------------------------------------------------------------------------------------------------------------------
// @brief		IIC_读字节
// @param		
// @return
// Sample usage: IIC_Read_Byte()
//------------------------------------------------------------------------------------------------------------------- 	  
uint8_t IIC_Read_Byte(unsigned char ack)
{
	unsigned char i,receive=0;
	SDA_IN();//SDA设置为输入
    for(i=0;i<8;i++ )
	{
    IIC_SCL(0); 
    // DWT_Delay_us(2);
		IIC_SCL(1);
    receive<<=1;
    if(READ_SDA)receive++;   
		//DWT_Delay_us(1); 
  }					 
    if (!ack)
        IIC_NAck();//发送nACK
    else
        IIC_Ack(); //发送ACK   
    return receive;
		
}
